function diangeText(){	   
		asyncbox.open({
		id:"popDiangeText", 
		modal:true,
		drag:false,
		width:580,
		height:440,
		title:"选择你对Ta说的话",
		html:'<div id="textWrap">\
  <dl class="current">\
   <dt>新年祝福</dt>\
   <dd>\
    <p><a title="贺新春，迎新年，祝你今年中大奖。加薪买房购小车，娶妻生子成家室。万事顺！合家欢！愿你如意福满年。 " href="#">贺新春，迎新年，祝你今年中大奖。加薪买房购小车，娶妻生子成家...</a></p>\
    <p><a title="感谢你的关怀，感谢你的帮助，感谢你对我做的一切……任何时间，请接受我最真心的祝愿！新年快乐，身体健康，多多发福！" href="#">感谢你的关怀，感谢你的帮助，感谢你对我做的一切……任何时间，...</a></p>\
    <p><a title="恭祝新年快乐!祝您在新的一年里：身体健康!工作顺利!生活美满!合家幸福,喜气萦绕!想不发财都困难!好事多多,欢乐多多!" href="#">恭祝新年快乐!祝您在新的一年里：身体健康!工作顺利!生活美满...</a></p>\
    <p><a title="祝福加祝福是无数个祝福，祝福减祝福是祝福的起点，祝福乘祝福是无限个祝福，祝福除祝福是唯一的祝福，祝福你新年快乐幸福平安！" href="#">祝福加祝福是无数个祝福，祝福减祝福是祝福的起点，祝福乘祝福是...</a></p>\
    <p><a title="难忘的是你我纯洁的友情，可贵的是永远不变的真情，高兴的是今生与你有缘，献上我最温馨的祝福，祝你新年愉快！" href="#">难忘的是你我纯洁的友情，可贵的是永远不变的真情，高兴的是今生...</a></p>\
    <p class="odd theLastOne"><a title="老婆：爱你！新年好！感谢你又一年辛勤的操劳！祝你新年工作顺利！身体健康！继续辛勤操劳！谢谢！：） " href="#">老婆：爱你！新年好！感谢你又一年辛勤的操劳！祝你新年工作顺利...</a></p>\
   </dd>\
  </dl>\
  <dl>\
   <dt>真心表白</dt>\
   <dd>\
    <p><a title="一个机缘认识你，两次见面留意你，三番四次约会你，七上八下挂念你，九成十分喜欢你，百世千年心不变！" href="#">一个机缘认识你，两次见面留意你，三番四次约会你，七上八下挂念...</a></p>\
    <p><a title="分分秒秒显得清澈又珍贵，只有你才能给我这种感觉，不管心多疲倦，梦想还有多远，有你陪伴一切都无所谓！I LOVE U！" href="#">分分秒秒显得清澈又珍贵，只有你才能给我这种感觉，不管心多疲倦...</a></p>\
    <p><a title="宝贝，爱我吧～拥有我，你天天都是情人节！拥有你，我天天都是劳动节！我们在一起，天天都会是狂欢节！" href="#">宝贝，爱我吧～拥有我，你天天都是情人节！拥有你，我天天都是劳...</a></p>\
    <p><a title="你是地球，我是月球，坚定不移绕着你走，在此我用字条代替卫星信号，送去我爱的请求，请允许我生生世世，深情地望着你，手拉着手到处走走。" href="#">你是地球，我是月球，坚定不移绕着你走，在此我用字条代替卫星信...</a></p>\
    <p><a title="漂亮得让我面红的人，温柔得让我心痛的人，透明得让我感动的人，坏坏得让我疯狂的人……你，是你，全是你，只有你！如果可以，我真想牵住你的手，跟你一起走。" href="#">漂亮得让我面红的人，温柔得让我心痛的人，透明得让我感动的人，...</a></p>\
    <p><a title="我不怕爱你路上遇到暴风雨，我要证明，我爱的诚意，因为我不能没有你！我不顾一切的爱你，甚至让我忘了我自己，我死心塌地，愿用一生陪你，让我们这一辈子永远在一起！" href="#">我不怕爱你路上遇到暴风雨，我要证明，我爱的诚意，因为我不能没...</a></p>\
    <p><a title="我们从相识到现在；从沉默到关怀；从未知到信赖；从陌生到关爱…已经走了多久？友达以上，恋人未满，已经等了多久？我期待一个圆满的结局：何时能和你牵手？" href="#">我们从相识到现在；从沉默到关怀；从未知到信赖；从陌生到关爱…...</a></p>\
    <p><a title="你必须无条件跟我走！我有理由把你长期扣留！你的爱不许向路人自由兜售！郑重声明，你和你的爱从今天开始属我私有！Well be together forever～" href="#">你必须无条件跟我走！我有理由把你长期扣留！你的爱不许向路人自...</a></p>\
    <p><a title="等你，却不知道结局，这是一种无奈；爱你，却不能与你长相厮守，这是一种痛苦；求此刻能拥有你，求此生能与你在一起！" href="#">等你，却不知道结局，这是一种无奈；爱你，却不能与你长相厮守，...</a></p>\
    <p><a title="天上有多少星光世间有多少女孩？但天上只有一个月亮世间只有一个你，我喜欢你，真的好喜欢！我想对你说：我爱你。" href="#">天上有多少星光世间有多少女孩？但天上只有一个月亮世间只有一个...</a></p>\
    <p><a title="也许爱你是我的过错，但不爱你就是我的错过，宁任由美丽的错误诞生，也不愿错过任何一次机会去说一声：我爱你永不变。过去是，现在是，将来也是……" href="#">也许爱你是我的过错，但不爱你就是我的错过，宁任由美丽的错误诞...</a></p>\
    <p><a title="从未试过如此想念一个人，从未试过如此关心一个人，从未试过如此担忧一个人，从未试过如此不想失去一个人……你让我第一次体会到真爱，请你接受我的感情吧！" href="#">从未试过如此想念一个人，从未试过如此关心一个人，从未试过如此...</a></p>\
   </dd>\
  </dl>\
  <dl>\
   <dt>真情誓言</dt>\
   <dd>\
    <p><a title="你是我的女人我是你的男人；你是我的心我是你的肝；你是我的全部我是你的一切；你是我的世界我是你的未来。这是我们一生的誓言。" href="#">你是我的女人我是你的男人；你是我的心我是你的肝；你是我的全部...</a></p>\
    <p><a title="你在我身边的每一天，我要让你感觉到幸福；你不在我身边的每一天，我会用思念和祝福制成一道幸运符，让我的心永远陪伴你！" href="#">你在我身边的每一天，我要让你感觉到幸福；你不在我身边的每一天...</a></p>\
    <p><a title="如果有一天，我化作了一抔黄土，这黄土上长出的青草也是为你而绿，如果有一天，我化作了一溪清泉，那叮咚的泉响也是为你而唱。只因我爱你无怨无悔……" href="#">如果有一天，我化作了一抔黄土，这黄土上长出的青草也是为你而绿...</a></p>\
    <p><a title="从今以后我只疼你一个人，答应你的每件事做到，别人欺负你我会在第一时间出来帮你，你开心我就会陪着你开心；你不开心我就会哄你开心。对你讲的每句话都是真心，永远觉得你是最漂亮的，梦里也只梦到你！" href="#">从今以后我只疼你一个人，答应你的每件事做到，别人欺负你我会在...</a></p>\
    <p><a title="遇见你之前，我不知道什么是真情纯爱，得到你之后，我才知道什么是刻骨铭心。你就是我的唯一，我对你永远专一，这些从未改变～愿我们永远拥有彼此，亲亲爱你！" href="#">遇见你之前，我不知道什么是真情纯爱，得到你之后，我才知道什么...</a></p>\
    <p class="odd theLastOne"><a title="爱是无言的承诺，情是无声的感应，爱与情融会，造就了你我爱与情的生命，这一生都将在柔情爱意中融化。亲爱的，愿我后半生中的每一个2月14，都能与你在这柔情爱意中度过！" href="#">爱是无言的承诺，情是无声的感应，爱与情融会，造就了你我爱与情...</a></p>\
   </dd>\
  </dl>\
  <dl>\
   <dt>苦涩暗恋</dt>\
   <dd>\
    <p><a title="不管是晴天、阴天、雨天，能见到你的一天，就是晴朗的一天；不管是昨天、今天、明天，能和你在一起的一天，就是美好的一天。" href="#">不管是晴天、阴天、雨天，能见到你的一天，就是晴朗的一天；不管...</a></p>\
    <p><a title="不是因为寂寞才想你，而是因为想你才寂寞。孤独的感觉之所以如此之重，也许只是因为想得太深。" href="#">不是因为寂寞才想你，而是因为想你才寂寞。孤独的感觉之所以如此...</a></p>\
    <p><a title="温柔的心送给伤心的人，浪漫的心送给有情的人，永恒的心送给等待的人，愉快的心送给烦恼的人，你的心是否能送给爱你的人呢？" href="#">温柔的心送给伤心的人，浪漫的心送给有情的人，永恒的心送给等待...</a></p>\
    <p><a title="遇到你心跳加快，不见你心情变坏，梦见你时间溜得太快，疏远你是我大脑痴呆，离开你也许会一辈子想不开。" href="#">遇到你心跳加快，不见你心情变坏，梦见你时间溜得太快，疏远你是...</a></p>\
    <p><a title="是不是爱一个人就是拨通电话时，忽然不知道说什么好，其实只是想听听那熟悉的声音，想拨通的只是自己心底的那根弦？" href="#">是不是爱一个人就是拨通电话时，忽然不知道说什么好，其实只是想...</a></p>\
    <p class="odd theLastOne"><a title="懂得放心的人找到轻松，懂得满足的人找到幸福，懂得遗忘的人找到快乐，懂得关怀的人找到朋友，懂得付出的人能否找到爱人？" href="#">懂得放心的人找到轻松，懂得满足的人找到幸福，懂得遗忘的人找到...</a></p>\
    <p><a title="世界上的人那么多，为什么我偏偏认识了你？自从认识了你，我生命的历程便掀开了新的篇章；我认识的人那么多，为什么我偏偏思念你？只要我念着你，我的心便坠入了蜜的海洋！" href="#">世界上的人那么多，为什么我偏偏认识了你？自从认识了你，我生命...</a></p>\
    <p><a title="世界上最遥远的距离，不是彼此相爱的人不能在一起，而是明明无法抵挡爱的想念，却还得故意装作丝毫没有把你放在心里。" href="#">世界上最遥远的距离，不是彼此相爱的人不能在一起，而是明明无法...</a></p>\
    <p><a title="于千万年之中，于千万人之中，在时间无涯的荒野中，没有早一步，也没有晚一步，刚好遇上了你！" href="#">于千万年之中，于千万人之中，在时间无涯的荒野中，没有早一步，...</a></p>\
    <p><a title="留下的眼泪虽自己擦，心中的热情却从不淡化。想着你的欢乐，想着你的忧愁，你的心情是我永远的牵挂！" href="#">留下的眼泪虽自己擦，心中的热情却从不淡化。想着你的欢乐，想着...</a></p>\
    <p><a title="最让人感到幸福的事，是当你在想着某人的时候而某人也在想着你，世上真有那么浪漫的事吗？如果你也正在想我的话那么我就是最幸福的人了！" href="#">最让人感到幸福的事，是当你在想着某人的时候而某人也在想着你，...</a></p>\
    <p class="odd theLastOne"><a title="喜悦是因你而起，忧伤也是为你而生，不管白天或夜里，不管相聚或分离，我总是惦念着你。只要你需要我，我将永远站在你身旁……" href="#">喜悦是因你而起，忧伤也是为你而生，不管白天或夜里，不管相聚或...</a></p>\
   </dd>\
  </dl>\
  <dl>\
   <dt>爱情火星语</dt>\
   <dd>\
    <p><a title="丆婹ぐ牠鎷啲纟合峩扌是憾綪， 栯⒈種鈊情..叫伈碎 ◇ 栯1種液体叫眼涙﹖謓魡じ☆veㄚòひ，岢鯢罘忄董d胗盻丆偠恠ωō。" href="#">丆婹ぐ牠鎷啲纟合峩扌是憾綪， 栯⒈種鈊情..叫伈碎 ◇ 栯1...</a></p>\
    <p><a title=".._ __xｘＸ( ;"、 弄х丟過 ﹂茨丆螚洅 丟暸 瀦厷●¨·窩們都葽幸福¨_べ" href="#">.._ __xｘＸ( ;"、 弄х丟過 ﹂茨丆螚洅 丟暸 瀦...</a></p>\
    <p><a title="答應我.不讓別人分享伱的愛o．....﹎繏擇了袮﹎゛就不後悔﹎..ヽo.゛ .╱愛到傷心議決╱..ヽo..┈ →;々" href="#">答應我.不讓別人分享伱的愛o．....﹎繏擇了袮﹎゛就不後悔...</a></p>\
    <p><a title="┍┍┍耐祢``藕Hǎσ辛苦╲\′ɑ; 潶銫葬禮■′___ ▄埋丅│． ·、′藕对祢哒íòvè●." href="#">┍┍┍耐祢``藕Hǎσ辛苦╲\′ɑ; 潶銫葬禮■′___ ...</a></p>\
    <p><a title="咽孓ωǒ糹伱說:耂嘙匛褆勞仧,劦掙↑稍息↓囨 許葙莂鍀囡亥孓,︻苆厛咾嘙Dé指揮" href="#">咽孓ωǒ糹伱說:耂嘙匛褆勞仧,劦掙↑稍息↓囨 許葙莂鍀囡亥孓...</a></p>\
    <p class="odd theLastOne"><a title="天氣再熱゜ ｛偶都不會煩︺~ωǒ要給妳打傘給妳買冰激淩ωǒ永遠愛妳ＹiＮ︵.王ZhＥnＰＥng誓_" href="#">天氣再熱゜ ｛偶都不會煩︺~ωǒ要給妳打傘給妳買冰激淩ωǒ永...</a></p>\
    <p><a title="鈈争气啲眼泪:绘划满钌眼眶.-.?壹滴滴鎏下来.、才发现硪吥能没宥你.-≧０≦" href="#">鈈争气啲眼泪:绘划满钌眼眶.-.?壹滴滴鎏下来.、才发现硪吥...</a></p>\
    <p><a title="愛佬公⒈輩吇??警告袮:ヘァ吥^喓背着硪ヽo勾З搭⒋○(￣﹏￣)○" href="#">愛佬公⒈輩吇??警告袮:ヘァ吥^喓背着硪ヽo勾З搭⒋○(￣﹏...</a></p>\
    <p><a title="送伱⒊千萬，千萬別忘記ωǒ，千萬要恏恏學習，千萬要快樂每一兲！└(^o^)┘" href="#">送伱⒊千萬，千萬別忘記ωǒ，千萬要恏恏學習，千萬要快樂每一兲...</a></p>\
    <p><a title="幸福給釕伱，快樂也給伱，蕞后ωǒ把伈交給伱，恏恏保管鈈要丟掉釕！~@^_^@~" href="#">幸福給釕伱，快樂也給伱，蕞后ωǒ把伈交給伱，恏恏保管鈈要丟掉...</a></p>\
    <p><a title="一個簡單擁抱能令伱感覺很恏↖(^ω^)↗ωǒ希望莪dé一個問候能夠令伱微笑^_~…因為薆伱僦要讓伱永遠快樂㊣o㊣" href="#">一個簡單擁抱能令伱感覺很恏↖(^ω^)↗ωǒ希望莪dé一個問...</a></p>\
    <p class="odd theLastOne"><a title="?想親口&amp;.對鉨說.ωǒ鈈能失去鉨，我们dě爱情☆|&amp;|?--僦算嘸囿結果|&amp;|但ωǒ依然薆你╮（╯◇╰）╭KISS！" href="#">?想親口&amp;.對鉨說.ωǒ鈈能失去鉨，我们dě爱情☆|&amp;|?-...</a></p>\
   </dd>\
  </dl>\
  <dl>\
   <dt>纯纯初恋</dt>\
   <dd>\
    <p><a title="不知道从什么时候开始，我开始慢慢的在乎你，你出现的地方我的眼睛总是不自觉的默默追随着你，你的洒脱、你的大笑、你的点点滴滴都会牵动我，我可曾注意到角落里默默守护着你的我？" href="#">不知道从什么时候开始，我开始慢慢的在乎你，你出现的地方我的眼...</a></p>\
    <p><a title="喜欢有事没事念你的名字；喜欢有事没事牵着你暖暖的手指；喜欢有事没事躺在你温柔的怀里。其实做什么都无所谓，只是喜欢和你在一起～" href="#">喜欢有事没事念你的名字；喜欢有事没事牵着你暖暖的手指；喜欢有...</a></p>\
    <p><a title="朱丽叶深爱着罗密欧，祝英台深爱着梁山伯，周瑜深爱着小乔，我老家的狗深爱着对面家的狗……有这么多革命先烈为榜样，你能学着更爱我一点吗？^3^" href="#">朱丽叶深爱着罗密欧，祝英台深爱着梁山伯，周瑜深爱着小乔，我老...</a></p>\
    <p><a title="希望睡前可以轻吻你，睡时可以抱着你，醒来可以看见你！一直都这样希望，直到永远。" href="#">希望睡前可以轻吻你，睡时可以抱着你，醒来可以看见你！一直都这...</a></p>\
    <p><a title="亲爱的，没有你在身旁真的是件很无聊的事情！不知道从什么时候开始，已经习惯了你的存在；不知从什么时候开始，已经不能和你分开。我只想每天都对你说"I love U~"" href="#">亲爱的，没有你在身旁真的是件很无聊的事情！不知道从什么时候开...</a></p>\
    <p class="odd theLastOne"><a title="喜欢在你怀里，那是因为想尽可能的与你最亲密接触，感受你的温暖，让你有力地紧紧将我环抱……然后做一个幸福小女人的美梦！" href="#">喜欢在你怀里，那是因为想尽可能的与你最亲密接触，感受你的温暖...</a></p>\
   </dd>\
  </dl>\
  <dl>\
   <dt>整蛊恶搞</dt>\
   <dd>\
    <p><a title="我悄悄蒙上你的眼睛，轻轻在你脚下放块西瓜皮，温柔地看你踩下去，深情地看你满地找牙--不要说我坏，因为我好想我们能在没牙的那天还是恋人！" href="#">我悄悄蒙上你的眼睛，轻轻在你脚下放块西瓜皮，温柔地看你踩下去...</a></p>\
    <p><a title="本人姓我，名爱你，字想你，大名叫懂你，学名叫疼你，乳名叫念你，书名叫梦你，笔名叫恋你，外号叫追你～看把你美的，我的真名叫逗你^_^" href="#">本人姓我，名爱你，字想你，大名叫懂你，学名叫疼你，乳名叫念你...</a></p>\
    <p><a title="感谢今生与你相识相知，我对你魂牵梦绕相思成灾。我确定你是我今生追求的至爱。没有你我的生活暗淡无光。我是多么的需要你，到我身边吧：给我你口袋里的人民币～" href="#">感谢今生与你相识相知，我对你魂牵梦绕相思成灾。我确定你是我今...</a></p>\
    <p><a title="你善良像猫儿，你忠实像狗儿，你可爱像鸟儿，你识途像马儿，你美貌像蝶儿，你勤劳像蜂儿，你厚道像牛儿…难怪大家都叫你……禽兽！记住不许对别人禽兽哦～" href="#">你善良像猫儿，你忠实像狗儿，你可爱像鸟儿，你识途像马儿，你美...</a></p>\
    <p><a title="我喜欢你！这不是闲着无聊在开玩笑，也不是吃饱了撑的想恶作剧，更不是和朋友打赌输了被迫的惩罚…其实是…我打错字鸟@_@" href="#">我喜欢你！这不是闲着无聊在开玩笑，也不是吃饱了撑的想恶作剧，...</a></p>\
    <p class="odd theLastOne"><a title="爱你一万年，夸张！爱你五千年，无望！爱你一千年，荒唐！爱你一百年，太长！接连爱你99年，只要身体健康，就是我的强项！" href="#">爱你一万年，夸张！爱你五千年，无望！爱你一千年，荒唐！爱你一...</a></p>\
   </dd>\
  </dl>\
  <dl>\
   <dt>失恋不哭</dt>\
   <dd>\
    <p><a title="你让我尝到了每时每刻想你的疼苦，尝到了和你在一起的快乐，尝到了离去的辛酸。我不会忘记，只有你是唯一让我尝过酸甜苦辣的人……" href="#">你让我尝到了每时每刻想你的疼苦，尝到了和你在一起的快乐，尝到...</a></p>\
    <p><a title="一个转身的距离，让你爱上了别人，这只能怪我不好。如果我对你好，你的爱还能不能转移？如果有来生，希望我们一转身，就可以看到对方！能够让我好好爱你。" href="#">一个转身的距离，让你爱上了别人，这只能怪我不好。如果我对你好...</a></p>\
    <p><a title="过去我们不懂爱，肆意挥霍着彼此的情感，当我们明白爱时，却早已物是人非。不论你选择什么，我都会祝福你，祝福你能收获幸福。" href="#">过去我们不懂爱，肆意挥霍着彼此的情感，当我们明白爱时，却早已...</a></p>\
    <p><a title="当爱情不能完美，我宁愿选择无悔；就算来生多么美丽，我也无法忘却今生对你的记忆！" href="#">当爱情不能完美，我宁愿选择无悔；就算来生多么美丽，我也无法忘...</a></p>\
    <p><a title="第一次牵手，第一次亲你，第一次吵架…好像还发生在昨天。我没有忘记你，只是把你放在了，心底最深处。可以再叫你一次亲爱的吗？" href="#">第一次牵手，第一次亲你，第一次吵架…好像还发生在昨天。我没有...</a></p>\
    <p class="odd theLastOne"><a title="谢谢你曾经给过我的幸福…哪怕这幸福所需的代价是那么那么的大…大到头破血流…但我依然珍惜这段记忆，谢谢你。" href="#">谢谢你曾经给过我的幸福…哪怕这幸福所需的代价是那么那么的大…...</a></p>\
   </dd>\
  </dl>\
\
</div>\
',
		callback : function(action){/*这里是回调函数*/}
	   });  
				
				$("#textWrap dd p").each(function(){
					var oldText=$(this).text();
					var Aindex=$(this).index()+1;
					$(this).find("a").text(Aindex+". "+oldText)
					})
					
						$("#textWrap dl dt").click(function(){
						$(this).parent().addClass("current").siblings().removeClass("current").end();
						$(this).find("dd").show().siblings().hide();
						})
						
						$("#textWrap dl p").hover(function(){
						$(this).toggleClass("hover");
						}).click(function(){
							var diangeVal=$(this).find("a").attr("title");
							$(".diange-form .textarea").val(diangeVal)
							asyncbox.tips('祝福语选择成功！','success',1500)
							setTimeout("$.close('popDiangeText')", 1000);
							$(".diange-form .textarea").focus();
							return false;
							})
}


//字数统计
function textareaWords(textarea,num){	
	$(textarea).bind('focus keyup input paste',function(){ 
		var commentTextIndex=$(this).attr("value").length;
	 	if(commentTextIndex>num){
			$(this).parent().find(".textarea-words").html("超出<strong>"+(commentTextIndex-num)+"</strong>字")
			$(this).parent().find(".textarea-words strong").css("color","#fb2f00")
		}else{
			$(this).parent().find(".textarea-words").html("还能输入<strong>"+(num-commentTextIndex)+"</strong>字")
			$(this).parent().find(".textarea-words strong").css("color","#390")
		}
	});
}

//文本域获得和失去焦点
function inputValue(){
	$(".c").css("color","#ccc")
	$(".input-value").focus(function(){
		var inputValue=$(this).val();
		if(inputValue==this.defaultValue){
			$(this).val("");
		}
		$(this).css("color","#666")
	});
	$(".input-value").blur(function(){
		var inputValue=$(this).val();
		if(inputValue==""){
			$(this).val(this.defaultValue);
			$(this).css("color","#666")
		}
	});
}

$(function(){
	inputValue();
	textareaWords(".diange-form .textarea",100);
	$(".chooseText ").click(function(){
		diangeText();
	})
})